Tekla Open API Reference for Tekla Structures 2025
Operation.Combine Method (RebarGroup, RebarGroup)
 Combines two rebar groups into one rebar group.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static RebarGroup Combine(
	RebarGroup ObjectToCombineTo,
	RebarGroup ObjectToBeCombined
)
Public Shared Function Combine (
	ObjectToCombineTo As RebarGroup,
	ObjectToBeCombined As RebarGroup
) As RebarGroup
Parameters
ObjectToCombineTo
Type: Tekla.Structures.Model.RebarGroup
The rebar group to be combined to.
ObjectToBeCombined
Type: Tekla.Structures.Model.RebarGroup
The rebar group which will be deleted after a successful operation.
Return Value
Type: RebarGroup
The combined rebar group on success, null on failure.
See Also
Reference
Operation Class
Combine Overload
Tekla.Structures.Model.Operations Namespace